algorithms/Read.org
:PROPERTIES:
:ID: Read
:END:
#+title: =Read=
#+OPTIONS: toc:nil

* Brief description
=Read= reads a cc4s tensor or set of tensors.

* Algorithm call

A typical input file snippet to call the [[id:Read][Read]]
algorithm is given below.

#+begin_src yaml
- name: Read
  in:
    fileName: "CoulombVertex.yaml"
  out:
    destination: CoulombVertex
#+end_src


* Algorithm input

# #+caption: Input keywords
#+name: reader-input-table
| Keyword               | Value |
|-----------------------+-------|
| =fileName=            | [[#what][what]]      |
|-----------------------+-------|

** what
:PROPERTIES:
:CUSTOM_ID: what
:END:


* Algorithm output
#+name: read-output-table
| Keyword          | Value |
|------------------+-------|
| =destination=           | [[#data][data]]      |
|------------------+-------|

** data
:PROPERTIES:
:CUSTOM_ID: data
:END:

** Sample =stdout=
The output of this algorithm reads
#+begin_src sh
step: 2, Read
Reading from binary file CoulombVertex.elements
realtime 0.292085915 s
#+end_src

** Sample =yaml= output

#+begin_src
floatingPointOperations: 0
flops: 0
in:
  fileName: CoulombVertex.yaml
name: Read
out:
  destination: 0x24878e8
realtime: 0.292085915
#+end_src

* Literature
bibliography:../group.bib


