algorithms/Read.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-07 Mon 10:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><code>Read</code></title>
<meta name="generator" content="Org mode" />

    <meta charset='UTF-8'>
    <meta name='apple-mobile-web-app-capable' content='yes'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>

    <link
      href='https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css'
      rel='stylesheet'
      integrity='sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU'
      crossorigin='anonymous'>

    <link rel="stylesheet" type="text/css" href="/user-manual/data/css/htmlize.css"/>
    <link rel="stylesheet" type="text/css" href="/user-manual/data/css/readtheorg.css"/>
    <link rel="stylesheet" type="text/css" href="/user-manual/data/css/rtd-full.css"/>

</head>
<body>
<div id="preamble" class="status">

 <nav id="cc4s-navbar" class='navbar fixed-top navbar-expand-md navbar-light bg-light'>
   <div class='container-fluid'>
     <a class='navbar-brand' href='#'>
       Cc4s
     </a>
     <button class='navbar-toggler' type='button'
             data-bs-toggle='collapse'
             data-bs-target='#navbarSupportedContent'
             aria-controls='navbarSupportedContent'
             aria-expanded='false'
             aria-label='Toggle navigation'>
       <span class='navbar-toggler-icon'></span>
     </button>
     <div class='collapse navbar-collapse' id='navbarSupportedContent'>
       <ul class='navbar-nav me-auto mb-2 mb-lg-0'>
         <li class='nav-item'>
           <a class='nav-link' aria-current='page' href='/user-manual/index.html'>
             <i class='fa fa-home'></i>
             Home
           </a>
         </li>
         <li class='nav-item'>
           <a class='nav-link' href='/user-manual/sitemap.html'>
             <i class='fa fa-sign-out'></i>
             Sitemap
           </a>
         </li>
         <li class='nav-item'>
           <a class='nav-link' href='/user-manual/algorithms/sitemap.html'>
             <i class='fa fa-sign-out'></i>
             Algorithms
           </a>
         </li>
         <li class='nav-item'>
           <a class='nav-link' href='/user-manual/objects/sitemap.html'>
             <i class='fa fa-sign-out'></i>
             Objects
           </a>
         </li>
       </ul>
     </div>
   </div>
 </nav>
</div>
<div id="content">
<h1 class="title"><code>Read</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d3f24c">1. Brief description</a></li>
<li><a href="#orgabd9b32">2. Algorithm call</a></li>
<li><a href="#org61dcab2">3. Algorithm input</a>
<ul>
<li><a href="#what">3.1. what</a></li>
</ul>
</li>
<li><a href="#org38c4158">4. Algorithm output</a>
<ul>
<li><a href="#data">4.1. data</a></li>
<li><a href="#org0212efb">4.2. Sample <code>stdout</code></a></li>
<li><a href="#orge331c00">4.3. Sample <code>yaml</code> output</a></li>
</ul>
</li>
<li><a href="#orgd3670ef">5. Literature</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1d3f24c" class="outline-2">
<h2 id="org1d3f24c"><span class="section-number-2">1</span> <a href="#org1d3f24c">Brief description</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Read</code> reads a cc4s tensor or set of tensors.
</p>
</div>
</div>

<div id="outline-container-orgabd9b32" class="outline-2">
<h2 id="orgabd9b32"><span class="section-number-2">2</span> <a href="#orgabd9b32">Algorithm call</a></h2>
<div class="outline-text-2" id="text-2">
<p>
A typical input file snippet to call the <a href="Read.html#ID-Read">Read</a>
algorithm is given below.
</p>

<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #8b4513;">name</span>: Read
  <span style="color: #8b4513;">in</span>:
    <span style="color: #8b4513;">fileName</span>: <span style="color: #50a14f;">"CoulombVertex.yaml"</span>
  <span style="color: #8b4513;">out</span>:
    <span style="color: #8b4513;">destination</span>: CoulombVertex
</pre>
</div>
</div>
</div>


<div id="outline-container-org61dcab2" class="outline-2">
<h2 id="org61dcab2"><span class="section-number-2">3</span> <a href="#org61dcab2">Algorithm input</a></h2>
<div class="outline-text-2" id="text-3">
<table id="orgc86e53d" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keyword</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>fileName</code></td>
<td class="org-left"><a href="#what">what</a></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-what" class="outline-3">
<h3 id="what"><span class="section-number-3">3.1</span> <a href="#what">what</a></h3>
<div class="outline-text-3" id="text-what">
</div>
</div>
</div>


<div id="outline-container-org38c4158" class="outline-2">
<h2 id="org38c4158"><span class="section-number-2">4</span> <a href="#org38c4158">Algorithm output</a></h2>
<div class="outline-text-2" id="text-4">
<table id="org6074b4b" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keyword</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>destination</code></td>
<td class="org-left"><a href="#data">data</a></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-data" class="outline-3">
<h3 id="data"><span class="section-number-3">4.1</span> <a href="#data">data</a></h3>
<div class="outline-text-3" id="text-data">
</div>
</div>

<div id="outline-container-org0212efb" class="outline-3">
<h3 id="org0212efb"><span class="section-number-3">4.2</span> <a href="#org0212efb">Sample <code>stdout</code></a></h3>
<div class="outline-text-3" id="text-4-2">
<p>
The output of this algorithm reads
</p>
<div class="org-src-container">
<pre class="src src-sh">step: 2, Read
Reading from binary file CoulombVertex.elements
realtime 0.292085915 s
</pre>
</div>
</div>
</div>

<div id="outline-container-orge331c00" class="outline-3">
<h3 id="orge331c00"><span class="section-number-3">4.3</span> <a href="#orge331c00">Sample <code>yaml</code> output</a></h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example">
floatingPointOperations: 0
flops: 0
in:
  fileName: CoulombVertex.yaml
name: Read
out:
  destination: 0x24878e8
realtime: 0.292085915
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3670ef" class="outline-2">
<h2 id="orgd3670ef"><span class="section-number-2">5</span> <a href="#orgd3670ef">Literature</a></h2>
<div class="outline-text-2" id="text-5">
<div class="csl-bib-body">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-02-07 Mon 10:14</p>
</div>
</body>
</html>
